[{"_id": {"$oid": "6552a3317f6551fba00e47cf"}, "artist_name": "The AfroWelsh Connection", "artist_bio": "Purring, engrossing, hypnotic; songs/set ripe with cadence; visually fascinating.\r\n\r\nThe band’s music is based on traditional kora tunes of the griots of West Africa, with some of kora player, Bunja’s own compositions added. The kora is a 21-stringed instrument: the African equivalent of our harp.\r\n\r\nAfroWelsh connection is made up of a group of talented individuals, bringing unique talents to the very special sound the band produces: Bunja Conteh is the kora player, hailing from The Gambia, West Africa. He is accompanied by his wife Liz Conteh on vocals and acoustic guitar. With Chandra Moon on flute, Terry Payne on mandolin and Lucy Marley on backing vocals and percussion, they produce music that is both hypnotic and groovy! Expect beautiful harmonies and melodies…and entrancement – ‘Something for everyone!’, as Liz relates.", "artist_url": "http://www.facebook.com/afrowelsh/", "artist_img": "xel55bgybajyox0l7den", "show1_stage": "River", "show1_start": {"$date": "2023-07-13T21:30:00Z"}, "show1_duration": "45", "show2_stage": "", "show2_start": {"$date": {"$numberLong": "-2208988800000"}}, "show2_duration": "", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "13-11-2023"}, {"_id": {"$oid": "6552a3af7f6551fba00e47d0"}, "artist_name": "Anna My Charlotte", "artist_bio": "Anna was at the top of our ‘hit list’ for each FotL for a number of years. Her music encapsulates what we’re all about and has enamoured many who have been fortunate to catch her performances. After a good few years away from us, she returns this year.\r\n\r\nAnna started playing the piano at age 5 and the harp at age 11. Her earliest – and possibly seminal –  musical experiences, however, involved playing the organ in a Welsh Baptist chapel. \r\n\r\nAs Anna studied the piano, she listened to performances of Debussy and Chopin. These influences continue to be relevant (and expanding: with opera taking on a meaning for her) but a whole load of more contemporary interests have been added to them, possibly within the folk/psych folk/avant-garde folk sphere: Yann Tiersen, guitarist Melanie Page (who has appeared twice at FotL), Trembling Bells and Joanna Newsom, with works by Kate Bush, Bjork and Nick Drake having significance also with regard to her writing.\r\n\r\nAnna sings in both English and Welsh. She has written, ‘I feel the need to sing in Welsh as it brings me close to my Welsh roots. I love languages. Especially when I lived away from Wales in the Midlands, the Welsh folk songs made me feel at home…as did the harp’. It was when living away from Wales – in the Leicestershire town of Loughborough – that her writing began (on the guitar, then autoharp, then ukulele and eventually lever harp. While the piano has remained a constant ‘go to’ instrument for Anna, professionally).\r\n\r\nAs those who have heard her will know, Anna’s songs often document her own family history (‘The stories my aunties told me about the family could be remembered better in song form’) and especially its quirks and oddities.", "artist_url": "https://annamycharlotte.bandcamp.com/", "artist_img": "bgc00xfj70g79c8s24xc", "show1_stage": "Cottage", "show1_start": {"$date": "2023-07-15T18:00:00Z"}, "show1_duration": "45", "show2_stage": "River", "show2_start": {"$date": "2023-07-16T11:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "21-11-2023"}, {"_id": {"$oid": "6552a4077f6551fba00e47d1"}, "artist_name": "The Blesséd Crow", "artist_bio": "The Blesséd Crow are Tim & Iona Crahart; a father and daughter folk duo from south Wales.\r\n\r\nThey write original songs in a decidedly traditional style and call upon folklore, true stories and spiritual themes for their inspiration. Many of their songs relate to local folk tales such at The Pwca or The Risca Cuckoo or to historical events like The Newport Rising or The Battle of Fishguard. All of this is tempered with a slice of good old fashioned protest songs, echoing the fact that folk music has always been about promoting the side of the underdog.\r\n\r\nTim and Iona share the vocal duties and harmonies are a big feature of their performances. The songs are accompanied by guitar or bouzouki, played by Tim and driven along by Iona’s bodhran.\r\n\r\nTim has played in a variety of bands since his youth but it was in 2019 that he turned his attention towards folk and released his first folk album, ‘Faith, Hope and Common Folk’, in February 2020 – in what he describes as the worst timed album release of all time! Any opportunity to promote the album was quickly cut short by Covid 19 and lockdown. Iona sang on several of the album tracks and as the world began to open up again the pair decided that being a duo was the way to go. The Blesséd Crow was born in the beginning of 2022.\r\n\r\nThey are currently in the studio working on their first album.", "artist_url": "https://www.facebook.com/theblessedcrow", "artist_img": "ggqg9ucg4v0zn76sqhxx", "show1_stage": "Bar", "show1_start": {"$date": "2023-07-14T18:00:00Z"}, "show1_duration": "45", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-16T11:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "13-11-2023"}, {"_id": {"$oid": "6552a90c7f6551fba00e47d2"}, "artist_name": "The Boxwood Chessmen", "artist_bio": "A wonderful semi-acoustic, four-piece band from East Anglia and Middlesex, raiding a fabulous musical pantry stocked with the finest roots ingredients – Folk, Americana, Angliana, hokum, a light dusting of swing all delivered with panache and fun…Pretty much anything goes into the pot. They call it ‘Gloriana’.\r\n\r\nThey self-describe as:\r\n\r\n‘Penni McLaren Walker – lead vocals, guitars, bouzouki, whistles, kazoo, accordion and percussion, not necessarily all at the same time.\r\n\r\nHector Ringtone, AKA Steve Collins – vocals, e-Melodeon, melodeon, ukulele, harmonica, guitar, kazoo and percussion. He misses Whicker Island.\r\n\r\nJohn Campbell Armer – vocals, bass, guitars, percussion and other noises.\r\n\r\nBryan Causton – vocals, mandolin, guitar, bouzouki and percussion. Which is nice.’\r\n\r\nThose who have been present at the band’s other FotL appearances (the last being in 2019) will testify to the sheer brilliance of their musicianship and material.", "artist_url": "http://www.theboxwoodchessmen.com/", "artist_img": "yopybjlv4l2ktantosyb", "show1_stage": "River", "show1_start": {"$date": "2023-07-15T17:45:00Z"}, "show1_duration": "45", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-15T21:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "13-11-2023"}, {"_id": {"$oid": "6552a9937f6551fba00e47d3"}, "artist_name": "Celtic Vagabond", "artist_bio": "Fueled by hundreds of years of cultural heritage and half a century’s worth of genre inspiration, Celtic Vagabond are a dazzling display of unadulterated love for their musical roots, and deeply-rooted nostalgia for the bands of their childhood. The duo’s visceral and rich sound-flows from the guitar, fiddle, banjo, another guitar, mandolin, synthesizer, some percussion and the famous PaddyApp.\r\n\r\nP@ddy “King of the Rocket Men” O’Turner brings his own very personal angle to traditional Irish music, Like no other. The seventh son of the seventh son of a guitar maker, dragged around folk festivals as a young boy and made to learn the violin. He was usually the bow going in the wrong direction in the orchestra so gave up violin forever (or so he thought at the time) in favour of a guitar. He learned to Rock, he learned to roll, he learned to set houses on fire.\r\n\r\nAmos “The Wig”, a student of the musical arts brings to the table a timeless mix of both old and new instruments, paying homage to folk tradition while pulling us gently into the future with otherworldly sounds seemingly taken directly from space itself!", "artist_url": "http://www.paddyoturner.com/media.html", "artist_img": "hr4qujp32b95dfzgkwgq", "show1_stage": "River", "show1_start": {"$date": "2023-07-15T21:00:00Z"}, "show1_duration": "45", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-15T20:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "13-11-2023"}, {"_id": {"$oid": "6552aa2d7f6551fba00e47d4"}, "artist_name": "Chloe Matharu", "artist_bio": "‘A voice of milk and honey’ – Anaïs Mitchell \r\n\r\nChloe Matharu is a female Indian/Scottish singer songwriter and harpist on the West Coast of Scotland. Many of her songs draw on her time as a Navigational Officer in the Merchant Navy, inspired by the natural world experienced at sea. Chloe’s voice, coupled with her harp playing, form a haunting combination perfectly suited to the reflective nature of her material. Her music offers a unique maritime narrative, an authentic voice for the female seafarer. Of mixed heritage, and crossing boundaries in her career at sea, Chloe is keen to explore breaking down cultural and gender barriers through the language of music. \r\n\r\nShe performs in Scots, English and Welsh. Her critically acclaimed debut album, Small Voyages, was Celtic Music Radio’s album of the week as well as being included in the top 20 of the World Music Charts Europe. She has been selected by Showcase Scotland to partake in the Womex awarded Global Music Match programme.\r\n\r\nPrivileged to host Chloe at FotL for the first time.", "artist_url": "https://www.youtube.com/watch?v=yIemixgOHWs", "artist_img": "uioj0rqh7b9fvmaeitcw", "show1_stage": "Mill", "show1_start": {"$date": "2023-07-15T12:30:00Z"}, "show1_duration": "45", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-15T17:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "13-11-2023"}, {"_id": {"$oid": "6555352a92b5857bdecdcc3f"}, "artist_name": "Vinna Bee The Apiary", "artist_bio": "Alternative Electronic/Folktronic/Pop artist Vinna Bee The Apiary has been performing & releasing her own music since 2013, taking her to over 150 appearances across the UK & the USA including, close to home, The Millennium Centre in Cardiff, and, far from home, Ashbury Heights, San Francisco and Pappy and Harriet’s in Pioneer Town, California.\r\n\r\nVinna Bee the Apiary’s music is often described as genre bending. It has taken her from the indie folk of her debut solo release on Quatre Femmes Records, ‘Treasures of the Apiarist’, through a plethora of EPs and singles in the past ten years on various labels, to, in 2022, finally achieving a lifelong wish with the release of the album, ‘The Golden Outer Lands’ where she wrote, demo-ed, played and produced the eleven-track named LP. It was hearing this – inspiring – album that led us at FotL to urge her to perform in 2023.\r\n\r\n‘Seductively ice toned in noir demurred intimacy, producing purring electronics, ghostly folk with that whole overall sense of something delightful’ – The Sunday Experience\r\n\r\n‘Eclectic and experimental in a liberating and good way’ – Bethan Elfyn, BBC radio\r\n\r\n‘Heavenly Beats Pop’ – Louder Than War\r\n\r\n‘Her music is a wonderful achievement in genre bending that is as adventurous as it is melodic, if you like music with an intense yet uplifting electronic edge, this LP is well worth your time’ – Independent Artist Buzz USA", "artist_url": "https://linktr.ee/Vinnabee_theapiary", "artist_img": "eqmgqqs4infk1xjulopk", "show1_stage": "Cottage", "show1_start": {"$date": "2023-07-14T18:00:00Z"}, "show1_duration": "45", "show2_stage": "Mill", "show2_start": {"$date": "2023-07-15T15:30:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65553d283f8e6d9912191042"}, "artist_name": "Soft Hearted Scientists", "artist_bio": "After releasing seven critically acclaimed albums between 2005 and 2016, Cardiff psychedelic collective Soft Hearted Scientists went on a hiatus, engaging in offshoot projects such as Nathan Hall and the Sinister Locals.\r\n\r\nThe band returned to the studio in late 2019 to record their new album “Waltz of the Weekend”, with all good intentions, but then small matters like a global pandemic and some life changing personal events got in the way. Nevertheless, when work resumed in 2022, some of the strongest songs on the album had been written in the meantime, and in fact the album is very much stronger because of the delay. It is a 75 minute double album monster featuring four action packed radio friendly Syd Barrett era Pink Floyd psychedelic singles such as “Rode My Bike” and “What Grows Inside the Garden?”, as well as some much longer and stranger songs like the eleven minute “Lost Mariners”, which the band hope will kick start a craze for aquatic ghost psychedelia. Several songs get hi jacked by the ghost of dub maestro Lee “Scratch” Perry half way through. The Scientists experiment more on this album than they ever have before and will be promoting it heavily.\r\n\r\nFolk on the Lawn will be their first live appearance since 2016, for which we feel extremely privileged!", "artist_url": "https://www.softheartedscientists.com/", "artist_img": "haqaisnjthkr5d0i4kww", "show1_stage": "River", "show1_start": {"$date": "2023-07-14T22:00:00Z"}, "show1_duration": "60", "show2_stage": "", "show2_start": {"$date": {"$numberLong": "-2208988800000"}}, "show2_duration": "", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65553df93f8e6d9912191043"}, "artist_name": "Shanghai Treason", "artist_bio": "Yorkshire banjo folk rockers Shanghai Treason have gone from strength to strength since launching in late 2019, they’ve supported the likes of Stiff Little Fingers, Ferocious Dog, Terrorvision, Skinny Lister, Buzzcocks, Bar Stool Preachers and Everly Pregnant Brothers. The band have also just completed an extensive UK tour supporting Celtic Punk legends, The Rumjacks. This March they have toured the UK with Hayseed Dixie.\r\n\r\nIt’s a high octane, knees up, feel good, party atmosphere kind of performance, leaving audiences with smiles all round and reaching for a fresh round of pints, or two, or more likely three.\r\n\r\nWe’re absolutely delighted that they’ve agreed to an inaugural performance at FotL!\r\n\r\n‘Leave you feeling happy but exhausted from hopping up and down on your feet’ – V13\r\n\r\n‘Best band of the weekend and no mistake’ – myglobalmind\r\n\r\n‘Celtic punk with a reyt Yorkshire twist’ – Whitwell Festival Of Music\r\n\r\n‘Great band. Brilliant tracks’ – BBC Radio Sheffield\r\n\r\n‘Folk-tinged punk rock, mixing snarling guitars with banjo’ – Nexus Music", "artist_url": "http://www.facebook.com/ShanghaiTreason", "artist_img": "r8fppx7igsjvynpzsuwc", "show1_stage": "River", "show1_start": {"$date": "2023-07-15T22:15:00Z"}, "show1_duration": "45", "show2_stage": "", "show2_start": {"$date": {"$numberLong": "-2208988800000"}}, "show2_duration": "", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65553e653f8e6d9912191044"}, "artist_name": "Sally Thompson", "artist_bio": "Sally writes, ‘Classically trained originally, my early teens up to the age of 16 were spent in orchestras and doing school concert tours (brass section). I know now that ‘school of rock ‘ would have suited me more , but there was little musical diversity in the school I attended, so this was my only outlet. I now enjoy many musical genres, but have always played in  a ‘folk’ style.\r\n\r\n‘My music is impressionistic, meditative and muted , despite being surrounded by blues and rock influences from my late teens. I have drawn from all these factors and what remains is my intention to absorb and learn from the many different artists I know and respect.’\r\n\r\nSally played two sets – with two different accompanying musicians/instruments – at FotL last year. We were spellbound. Visual as well as musical artist, we are delighted to welcome her back for a second year.", "artist_url": "https://soundcloud.com/sally-thompson-2", "artist_img": "vo2npfmdcb43vkikvl5u", "show1_stage": "River", "show1_start": {"$date": "2023-11-15T14:15:00Z"}, "show1_duration": "45", "show2_stage": "", "show2_start": {"$date": {"$numberLong": "-2208988800000"}}, "show2_duration": "", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65553eb73f8e6d9912191045"}, "artist_name": "The Rob Connolly Band", "artist_bio": "Rob Connolly are an acoustic group based in Chepstow playing an energetic mix of well-known and self-penned songs. Mike and Andy first got together on guitars back in 2015 and now play with Jill on cajón and percussion, with all providing fabulous harmonies.\r\n\r\nThe band’s name has a unique origin: the founding members, Andy and Chris, in an effort to give one of their early songs increased credibility, ascribed it to ‘Rob Connolly’. The pretence lasted minutes but Andy vowed that, if they were to start gigging, they would sing under the moniker of their fictional singer-songwriter. The rest is history.\r\n\r\nAs with all ‘folkies’ they sing a lot about joy, love, life and loss but all with lots of fun and verve. Come and see these guys and expect to be entertained, challenged and involved!\r\n\r\nThe Band, this year, will perform on the bar stage, due to using some striking video backdrops. Their performances should not be missed.", "artist_url": "https://www.robconnollyband.com/", "artist_img": "zogpnaxe8xt4g3igadi1", "show1_stage": "Bar", "show1_start": {"$date": "2023-07-14T20:00:00Z"}, "show1_duration": "60", "show2_stage": "Bar", "show2_start": {"$date": "2023-07-15T20:00:00Z"}, "show2_duration": "60", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "16-11-2023"}, {"_id": {"$oid": "65553f0e3f8e6d9912191046"}, "artist_name": "Piskey Led", "artist_bio": "Formed in late 2021, Piskey Led play a kaleidoscopic mixture of original and traditional music drawn from the folk traditions of Cornwall, north England and Ireland. Made up of veteran musicians versed in a multitude of genres, they bring together their eclectic and diverse influences to create an approach to folk music only they can offer.\r\n\r\nWith Cornish Katie Lower on flute and whistles, Lancastrian Josh Goodey on double bass, harmonium and mandocello, Donegal man James Bower on guitar and Belfast boy Chris Mercer on mandolin, bouzouki, harmonicas and bodhrán, they are staples of the south Wales folk scene, and have been honing their setlist across the UK over the last year.\r\n\r\nThey can set the room on fire with a set of incandescent reels one minute and elate an audience with a four-part-harmony ballad the next, hopping between instruments the whole time. Their debut album is to be released in spring 2023. ", "artist_url": "https://piskeyledband.co.uk/", "artist_img": "zg2gpfury3og1crxmkso", "show1_stage": "River", "show1_start": {"$date": "2023-07-16T17:15:00Z"}, "show1_duration": "60", "show2_stage": "", "show2_start": {"$date": {"$numberLong": "-2208988800000"}}, "show2_duration": "", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65553f993f8e6d9912191047"}, "artist_name": "Pieces Of Work", "artist_bio": "A very late addition to the FotL line-up. Arguably the result of public pressure!\r\n\r\nAn ensemble formed to execute versions of many songs that were staples of their writer’s (Jon’s) bands when he and Jem (the band’s drummer) first came to know the late Sean Townsend, a much-missed part of the FotL team, as well as an outstanding keyboard player and multi-instrumentalist who, after attending a gig 20 years ago, became a part of the bands as well as a source of encouragement for Jon and his writing.\r\n\r\nFittingly, a hugely talented bunch agreed to be part of this project. In addition to Jon Airdrie (acoustic guitar and vocals): Louse Hiscott – violin and vocals; Will Holmes – electric guitar and vocals; Andy Ponsford – bass; Jem Ponsford – drums and vocals.", "artist_url": "", "artist_img": "r6lnqbdznfzjbb53iu0v", "show1_stage": "River", "show1_start": {"$date": "2023-07-13T16:00:00Z"}, "show1_duration": "60", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-15T13:00:00Z"}, "show2_duration": "45", "show3_stage": "Bar", "show3_start": {"$date": "2023-07-15T19:00:00Z"}, "show3_duration": "45", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "655540023f8e6d9912191048"}, "artist_name": "Peter Gowen", "artist_bio": "Having begun writing poetry to get over the fact that, at 16, he could not get a girlfriend, Peter has not been “getting a girlfriend” for 48 years.\r\n\r\nIn that time, Peter has developed a relaxed, welcoming style. His focus rests firmly on bringing a little nonsense to a world swamped with grimness (if you believe the news).\r\n\r\nDon’t be afraid to laugh, groan, moan or offer a million pound world tour and book deal, it’s to be encouraged.\r\n\r\nHis latest show; “Baaad in Bed with Me Leg”, comes to FotL 23- “Be there or wear flares”.\r\n\r\nYou have been warned.\r\n\r\nA huge presence at our event (and, increasingly, others) for a number of years, Peter is a joy to listen to and – if you get the opportunity – spend some time with.", "artist_url": "", "artist_img": "vor8gi110fgk9vmgyafy", "show1_stage": "River", "show1_start": {"$date": "2023-07-14T17:00:00Z"}, "show1_duration": "45", "show2_stage": "Bar", "show2_start": {"$date": "2023-07-15T18:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "655540833f8e6d9912191049"}, "artist_name": "Paul Hayes", "artist_bio": "Acclaimed singer/songwriter Paul Hayes, originally from north Manchester now living in the Preseli Hills, Pembrokeshire. Paul’s music is a mix of traditional folk songs with his own twist and original songs written with a traditional feel.\r\n\r\nPaul has been writing, singing and performing all his life and having quit the day job in 2007 he has concentrated on his music.\r\n\r\nHis latest album ‘The Ancient Holly’, released on SWND records has received lots critical acclaim:\r\n‘Recorded in at his remote Welsh studio during lockdown, Paul has once again delivered an album of exquisite beauty and melody taking the listener back to a time before the digital age’; Brilliantly played, sung, recorded and produced by Paul. I listened to the download once and ordered my own copy. Look out for him, I will be. I do not think we are going to be disappointed’. John Eliot, SWND magazine.\r\n\r\n‘Paul has a warmth that draws you into his songs and it’s easy to get lost on a musical and emotional journey with the man as he leads you along his musical road’ – Michael Kennedy, Welsh Connections.\r\n\r\n‘Magical tales, sad tales, passionately sung, beautiful played. And with a touch of quirk, which I very much like.’ – B B Skone.\r\n\r\n‘Manchester born songwriter Paul Hayes brings a delicious bardic darkness to his approach to traditional and original songs, reminiscent of Robin Williamson and Steve Ashley’. – Marrtin Allcock.", "artist_url": "https://paulhayesfolk.co.uk/", "artist_img": "hopsrpz4jwg9jooknvxe", "show1_stage": "River", "show1_start": {"$date": "2023-07-14T18:00:00Z"}, "show1_duration": "45", "show2_stage": "Mill", "show2_start": {"$date": "2023-07-15T11:00:00Z"}, "show2_duration": "60", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "16-11-2023"}, {"_id": {"$oid": "65554112010f0c0d36f663d3"}, "artist_name": "My Mate Dave", "artist_bio": "My Mate Dave: A female fronted four-piece combining folk, acoustic pop and vaudeville. With banjo, ukulele, fiddle, flute and four singers in close harmony, their music is mostly self-written – drawing on influences from gypsy folk with shades of bluegrass, and always a lot of fun. Their repertoire is mostly original music, with a few reworked familiar songs, some A Capella, thrown in.\r\n\r\nSince forming in 2018, My Mate Dave have graced the Small World and Mandala Stages at Glastonbury, Bearded Theory, Lakefest, Green Gathering and the Main Stage at Bunkfest, and count Tankus the Henge among their support credits. 2023 will see the release of their first studio album, set for release in the spring.\r\n\r\n‘The seemingly effortlessly skilful, yet joyously silly My Mate Dave’- The Fossilheads\r\n\r\n‘Excellent acoustic four piece combining folk, vaudeville, pop and close harmony I defy anyone to not be uplifted after a My Mate Dave gig’ – Kate Etheridge\r\n\r\n‘Their live performances are full of joy and fantastic songs. It’s impossible to not smile and have a great time when listening to them’ – Mark Idle Beaver Anson\r\n\r\n‘Fun, upbeat and exciting barber shop folk’ -Gail Something-Else, organizer of the Something-Else festivals", "artist_url": "https://www.facebook.com/mymatedavemusic/", "artist_img": "hshasghnuwejx3d4yxmb", "show1_stage": "River", "show1_start": {"$date": "2023-07-13T17:30:00Z"}, "show1_duration": "45", "show2_stage": "River", "show2_start": {"$date": "2023-07-16T12:30:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65554158010f0c0d36f663d4"}, "artist_name": "Mike Parker", "artist_bio": "Roots, blues, folk & Americana come together skilfully in the repertoire of singer/songwriter Mike Parker. Mike’s love of steel guitars combines with his distinctive technique, and meticulous yet free picking, to present a truly original delivery of classics and a classic delivery of originals.\r\n\r\nMike has been performing professionally for over 25 years throughout the UK at festivals, clubs and concert venues. He has had the pleasure of touring with American blues virtuoso Joe Bonamassa on several of his UK tours, as well as performing alongside Robin Trower, Walter Trout and an array of classic rock and blues artists.", "artist_url": "http://www.soundcloud.com/mikeparkermusic", "artist_img": "o1bmfjsg1hj6hsl6bots", "show1_stage": "Bar", "show1_start": {"$date": "2023-07-14T19:00:00Z"}, "show1_duration": "45", "show2_stage": "", "show2_start": {"$date": {"$numberLong": "-2208988800000"}}, "show2_duration": "", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "655541a3010f0c0d36f663d5"}, "artist_name": "Melody Causton", "artist_bio": "Side stage, sleeping in guitar cases whilst her parents performed, Melody naturally landed here. She’s now embracing the tea drinking, story-telling life of a folk songstress.\r\n\r\nAged 28, singer-songwriter Melody Causton has released her own material, supported a number of respected acts within the genre and has gained valuable support from her local BBC-Introducing Cambridge show and BBC Radio Essex too.\r\n\r\nMelody has also now won ‘Best Female Solo Artist’ at Cambridge NMG awards three times and came third in the ‘Best Unsigned Female’ category  at the 2017 BOB Unsigned Music Awards,  in association with Vocalzone.\r\n\r\nMelody first played at FotL when still a young teenager. After a lengthy break, we’re delighted that she’s agreed to return.", "artist_url": "https://www.melodycauston.co.uk/", "artist_img": "tzsnkf2qwurfdtyn96ln", "show1_stage": "River", "show1_start": {"$date": "2023-07-15T13:15:00Z"}, "show1_duration": "45", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-16T13:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "655541f1010f0c0d36f663d6"}, "artist_name": "Maddi O’Brien", "artist_bio": "Hailing from the hills of New South Wales, travelling troubadour Maddi O’Brien sings ambient folk and melodious lover blues with a warbling bush twist. Leaving Australia with a one-way ticket in her early twenties, she quickly fell into a life of adventure and vagabondage, traversing across Europe, the Middle East and North Africa for several years with eccentric folk from all walks of life. She busked streets across the Northern Hemisphere, from the laneways of Northern Italy to the footbridges of South Portugal, to the railway stations of Berlin and the esplanades of Istanbul, learning local folk songs and the ballads of gypsies along the way.\r\n\r\nMaddi has recently debuted her independent album “Deprivation Blues,” a collection of intimate, husky lullabies that shimmer with dreamy nostalgia, exploring themes from mental health to unrequited love & loss, woven with vulnerable lyricism so raw it feels as if a disclosure of secrets, reflecting her own authentic underground. Her sultry words of poetry come to life as if your own distant memories.\r\n\r\nHugely honoured to have this extraordinary artist at Folk on the Lawn 2023.", "artist_url": "https://www.facebook.com/maddiobrienmusic/", "artist_img": "nxepuvoiichmfjmwwpee", "show1_stage": "River", "show1_start": {"$date": "2023-07-15T19:15:00Z"}, "show1_duration": "45", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-16T14:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65554241010f0c0d36f663d7"}, "artist_name": "Lunabarge", "artist_bio": "The double-stomping, indie-folk duo Lunabarge are Kelly Anne (My Mate Dave) & William Harper (Hobo Jones & The Junkyard Dogs, The Devil’s Prefects): A collaboration born one fateful night when My Mate Dave & The Devil’s Prefects first shared a stage together. Together, armed with banjo, guitar and ukulele, they bring you their catchy original songs covering topics such as date disasters, dinosaurs, holidays in space and the London Underground, in hope that they will bring out your very best foot taps, slow head nods and beard strokes (should happen to possess a beard). They have just released their debut album with many more new songs on the way.\r\n\r\n“Engaging duo with endearing chemistry and presence, charming everyone with beautiful catchy songs” – Brian Stone – musician\r\n\r\n“Wonderfully twee (but) obviously got a screw loose” – Dave Milligan – Round at Milligans\r\n\r\n“The King & Queen of quirky earworms” – Teegan-Jane’s Bakery\r\n\r\n“Unnecessarily good!” – Stuart Blakeledge – The Sweetchunks Band, Voice FM", "artist_url": "https://www.facebook.com/LunaBargeBand/", "artist_img": "kgb1d4czxvxluczj1asd", "show1_stage": "River", "show1_start": {"$date": "2023-07-13T19:30:00Z"}, "show1_duration": "45", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-16T15:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "6555427a010f0c0d36f663d8"}, "artist_name": "Lo-fi Jones", "artist_bio": "Forged in slate and small-town angst in the foothills of Eryri by bearded brothers Liam and Siôn Rickard, Lo-fi Jones weave tales of love and loss in an ever changing landscape. Audiences can expect a high-energy performance with music spanning multiple genres and songs in both Welsh and English.\r\n\r\nLo-fi Jones recently performed in the final of Cân i Gymru on S4C.\r\n\r\nDau frawd barfog o Fetws-y-coed yw Lo-Fi Jones, Liam a Siôn Rickard. Maent yn plethu straeon o gariad a cholled mewn tirwedd sy’n newid yn barhaus, gan fynd a’r gynulleidfa ar daith lle caiff momentau o addfwynder eu cyfosod â swrealaeth, anarchiaeth, ac awyrgylch parti, gyda chaneuon amrywiol yn y Gymraeg a’r Saesneg.\r\n\r\nEleni, befformiodd Lo-fi Jones yn y rownd derfynol Cân i Gymru.", "artist_url": "https://www.facebook.com/lofijones/", "artist_img": "gzowrhsptyc7lskmk7r4", "show1_stage": "River", "show1_start": {"$date": "2023-07-13T20:30:00Z"}, "show1_duration": "45", "show2_stage": "", "show2_start": {"$date": {"$numberLong": "-2208988800000"}}, "show2_duration": "", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "655542b9010f0c0d36f663d9"}, "artist_name": "The Kris Nock Big Band", "artist_bio": "The Kris Nock Big Band is a highly talented big band based in the south west of England. Formed in 2018, the 18-piece big band has performed at multiple festivals including Wychwood Festival, Thornbury Jazz Festival and Brecon Jazz Festival and has won numerous awards including Gold award at the Indoor Music Games and multiple Platinum awards at the National Concert Band Festival. A ‘high octane’ and ‘highly drilled unit’, the Kris Nock Big Band is quoted by Jazzman as being an act to look out for in the future.\r\n\r\nBringing this huge ensemble to FotL involved a stroke of very good fortune: due to family connections, Kris (Musical Director) was at last year’s festival; conversations ensued, much planning took place…and here we are, staging something unique as far as our event is concerned.\r\n\r\nKris has over 20 years’ experience as a trumpet player and completed is BA(Hons) in Music at Bath Spa University and Montana State University Billings in the United States. He’s toured nationally and internationally, and has performed with and for artists including Wayne Bergeron (Gordon Goodwin’s Big Phat Band), Ron Blake (Greenday), Karl Jenkins (composer), Will Todd (composer) and Louis Dowdeswell.", "artist_url": "https://www.krisnockbigband.com/", "artist_img": "clzuh456gaeqg2crwodo", "show1_stage": "Cottage", "show1_start": {"$date": "2023-07-15T14:00:00Z"}, "show1_duration": "45", "show2_stage": "River", "show2_start": {"$date": "2023-07-15T16:15:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65554304010f0c0d36f663da"}, "artist_name": "Darren James", "artist_bio": "‘Darren James is a fine and perceptive singer-songwriter, capable of writing touching, poignant and fun songs, characterized by an authentic and human touch, strong melodies, big choruses and music that’s easy to fall in love with’ – Nova Music Blog\r\n\r\nDarren James is a Welsh singer-songwriter based in Cardiff. Born in Quakers Yard in the Merthyr Valley, he began playing in various bands at the age of 16.\r\nDarren has been signed by Sondar Records, leading to a debut album – Better Late Than Never, produced by Nick Brine (Oasis, The Verve, Stereophics, The Darkness) – and a succession of singles.\r\n\r\nHis guitar playing is influenced by Hendrix, Clapton, Knopfler and Gary Moore. Songwriting influences include Paul Simon, Tom Waites, Chris Difford (Squeeze) and musical influences include Muse and Radiohead.\r\n\r\nDarren’s songs are observational, story-based and draw on real-life experiences. He tackles difficult subjects such as love, relationships, loss and happiness in a manner that is down-to-earth, uplifting, sometimes funny/sometimes sad, but with always a tug on the heartstrings…and the gift of an earworm.", "artist_url": "http://www.sondar-records.com/darren-james", "artist_img": "x7gdgli2ashzk6wy8h06", "show1_stage": "Cottage", "show1_start": {"$date": "2023-07-14T20:00:00Z"}, "show1_duration": "45", "show2_stage": "River", "show2_start": {"$date": "2023-07-15T14:45:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "6555434d010f0c0d36f663db"}, "artist_name": "Dragons Breath", "artist_bio": "From the mystic landscape of South Wales comes this idiosyncratic fusion of musicians.\r\n\r\nOffering a captivating treasury of songs and tunes, Dragons Breath celebrates the rich diversity of humanity from merriment to misery.\r\n\r\nThey have played for festivals, concerts, folk clubs, ceilidhs, twmpathau, weddings, fundraisers, street parties and back gardens throughout Wales and the borders.\r\n\r\n…and twmpathau it is for us! Get your dancing shoes/clogs on for Sunday afternoon at FotL!", "artist_url": "http://www.dragons-breath.co.uk/", "artist_img": "yzccuzk1maprm4nhu3qm", "show1_stage": "Cottage", "show1_start": {"$date": "2023-07-14T19:00:00Z"}, "show1_duration": "45", "show2_stage": "Mill", "show2_start": {"$date": "2023-07-16T13:15:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65554386010f0c0d36f663dc"}, "artist_name": "Goodnight Vincent", "artist_bio": "‘Combines the heart of Christy Moore, the voice of Nick Cave, and music that has a synergy between The National and The Waterboys’ – Clash; ‘Authentic, rare music that makes you smile’ – Info Music; ‘Powerful, inspiring, and empathic… the perfect moment of catharsis’ – Find No Enemy; ‘It feels to me that Nick Cave has joined Fleetwood Mac and The Divine Comedy and made a record. Immense. Iconic’ – Matt Black, Black on Track; ‘Nestles somewhere between the bellow of Eric Burden and the resistant folk of softer Kurt Cobain’ – The Wild is Callin\r\n\r\nThe new Goodnight Vincent line-up has led to a swerve from folk-rock firmly into the lane of indie-rock, with ferocious and exhilarating saxophone, groovy and pounding bass, and – as the band describe – a human metronome on percussion, alongside the well-established duo of vocals and guitar.", "artist_url": "https://www.goodnightvincent.com/", "artist_img": "ut3foexdtoslydzos6vj", "show1_stage": "Cottage", "show1_start": {"$date": "2023-07-15T19:00:00Z"}, "show1_duration": "45", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-16T12:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65554400010f0c0d36f663dd"}, "artist_name": "The Face That Boils Itself", "artist_bio": "The band is called ‘the face that boils itself’ and that is impossible to explain.\r\n\r\nIts members are wholly dedicated to expressing the fundamental nature of the human spirit.\r\n\r\nFourteen years have passed since the unchanged formation of this extraordinary Nottingham trio.\r\n\r\nSound descriptions lean towards honest and earthy yet equally ethereal and eldritch.\r\n\r\nLyrical subject takes us right to the cusp of the epistolary horizon.\r\n\r\nMarvin Strapp gob-mouthing a lugubrious noise\r\n\r\nNelson Fortune stepping percussive and grotesque\r\n\r\nBarry Stazwac emitting mystic and obscure reverberation\r\n\r\nSomething essentially undefinable in simple terms, but totally brilliant. Crafted, insightful, compelling songs; unique performances.", "artist_url": "http://www.thefacethatboilsitself.co.uk/", "artist_img": "j1g1rfct4cfarvszzpza", "show1_stage": "River", "show1_start": {"$date": "2023-07-14T20:00:00Z"}, "show1_duration": "45", "show2_stage": "River", "show2_start": {"$date": "2023-07-15T21:30:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65554446010f0c0d36f663de"}, "artist_name": "Filkin’s Drift", "artist_bio": "Meeting in the multicultural city of Birmingham, Filkin’s Drift weave together intricate melodies from the folklore of their homes, Wales and Gloucestershire. Their music combines the traditional and the contemporary, blending fiddle, guitar, harmonium and mandolin with their close vocal harmonies.\r\n\r\nOrnate interplay between two fretted instruments conjures up a Baroque soundworld; meanwhile their foot-stomping fiddle and guitar tunes have been igniting audiences across the UK.\r\n\r\nChris Roberts’ training in classical guitar means he soars effortlessly through jigs and reels with an unrivalled purity in his steel string playing. Chris’s performances have been praised for their “beautifully varied timbres, real virtuosity” and for being “simply mesmerising” (The British and International Federation of Festivals).\r\n\r\nSeth Bye has been long established on the folk scene, performing with The Destroyers, Joe Broughton’s Conservatoire Folk Ensemble and Gathering Tides. His “fantastic fiddle-driven energy” (BBC Radio Glos) and multi-instrumental abilities combine with a showmanship that could only be gained from touring with Giffords Circus.\r\n\r\nThey played for us last year for the first time, It was an exquisite performance. Delighted that they are able to return.", "artist_url": "http://www.filkinsdrift.com/", "artist_img": "bihsvryxjler3b1qrpta", "show1_stage": "River", "show1_start": {"$date": "2023-07-14T16:00:00Z"}, "show1_duration": "45", "show2_stage": "Cottage", "show2_start": {"$date": "2023-07-14T21:00:00Z"}, "show2_duration": "60", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "6555450b010f0c0d36f663df"}, "artist_name": "Gareth Davies", "artist_bio": "Gareth Davies is a singer songwriter based in South Wales who writes original songs in a folk/blues style, and likes to explore a variety of different guitar tunings. Gareth takes inspiration from nature, old folk themes and spirituality, and interweaves these with poetry of life experiences.\r\n\r\nHe has been playing live as a solo act for approximately 10 years, in south Wales and also further afield in the UK.\r\n\r\nLast year was his first at Folk on the Lawn. Those who witnessed his sets would have been struck by the immense skill and versatility of his guitar work – airy and yet precise – together with a delicately understated vocal delivery: little songs of great delight.\r\n\r\nGareth has recorded six self-produced albums to date. Three are available at the link below, including Time and Tide, his most recent record and one we’d heartily recommend.", "artist_url": "http://www.garethdavies.bandcamp.com/", "artist_img": "xtm2cmf4xdbwq4wnrolg", "show1_stage": "Cottage", "show1_start": {"$date": "2023-07-14T17:00:00Z"}, "show1_duration": "45", "show2_stage": "Mill", "show2_start": {"$date": "2023-07-15T14:00:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "65554548010f0c0d36f663e0"}, "artist_name": "The Iambic Assassin", "artist_bio": "The Iambic Assassin (Mark Jefferis) is a poet, who prefers to refer to himself as a promoter of silly verse. He was first drawn to poetry reading limericks in The Topper children’s comic book at about the age of eight and can still remember a few of them.\r\n\r\nIn his teens he became a big fan of The Goons, especially Spike Milligan, who he managed to see when Spike was at the ripe old age of 80 playing a gig at The Civic Hall, Wolverhampton. It was 1998, the year ‘On The Ning Nang Nong’ was voted Britain’s favourite comic poem.\r\n\r\nIn later years The Iambic Assassin discovered the good doctor, John Cooper Clarke, and more contemporary poets like Dr JCC’s younger friends, Luke Wright and Clare Ferguson Walker. For many years Mark has penned poems for friends and special family occasions.\r\n\r\nThe Iambic Assassin has not confined himself to the spoken/written word alone, however. A fine singer/songwriter/multi-instrumentalist, he has produced some excellent aural work, both solo and with various collaborators.\r\n\r\nHis performances last year were relaxed and yet compelling. Delighted he has agreed to return.", "artist_url": "https://www.iambicassassin.com/", "artist_img": "cflvmhepizhsdtfgaldx", "show1_stage": "Cottage", "show1_start": {"$date": "2023-07-15T12:00:00Z"}, "show1_duration": "45", "show2_stage": "Mill", "show2_start": {"$date": "2023-07-16T23:45:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}, {"_id": {"$oid": "6555457f010f0c0d36f663e1"}, "artist_name": "Kahlo After Frida", "artist_bio": "Kahlo After Frida brings together the solo (flamenco inspired/folk/blues) guitar playing of Simon Cottle with the arresting vocals of Louise Armstrong.  A unique fusion of ambient compositions and reinterpretations results (and performed in the independent spirit of the Mexican artist Frida Kahlo).\r\n\r\nThis year the duo have been showcasing a suite of original songs responding to today’s ecological and climate emergency. They produce a unique sound which we are privileged to give a platform to again at Folk on the Lawn.", "artist_url": "https://www.kahloafterfrida.com/", "artist_img": "ah3ui94hetjfhxamzax7", "show1_stage": "River", "show1_start": {"$date": "2023-07-15T23:45:00Z"}, "show1_duration": "45", "show2_stage": "River", "show2_start": {"$date": "2023-07-16T15:45:00Z"}, "show2_duration": "45", "show3_stage": "", "show3_start": {"$date": {"$numberLong": "-2208988800000"}}, "show3_duration": "", "last_edit_by": "nicksmith", "last_edit_on": "15-11-2023"}]